---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DecalFailures.LongerThanPossible
source: html/5e5378e8-ee23-c4f0-231c-fe92c925de59.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DecalFailures.LongerThanPossible Property

Decal element is longer than the circumference of the surface.

## Syntax (C#)
```csharp
public static FailureDefinitionId LongerThanPossible { get; }
```